import type { Lang } from "#shared/types/rule";

export const tg: Lang = {
    langName: 'Tajik',
    rules: {
        iso_9_1995: {
            name: 'ISO 9',
            desc: 'International standard for converting Cyrillic letters into Latin letters',
            map: {
                'А': 'A', 'а': 'a',
                'Б': 'B', 'б': 'b',
                'В': 'V', 'в': 'v',
                'Г': 'G', 'г': 'g',
                'Ғ': 'Ġ', 'ғ': 'ġ',
                'Д': 'D', 'д': 'd',
                'Е': 'E', 'е': 'e',
                'Ё': 'Ë', 'ё': 'ë',
                'Ж': 'Ž', 'ж': 'ž',
                'З': 'Z', 'з': 'z',
                'И': 'I', 'и': 'i',
                'Ӣ': 'Ī', 'ӣ': 'ī',
                'Й': 'J', 'й': 'j',
                'К': 'K', 'к': 'k',
                'Қ': 'Ķ', 'қ': 'ķ',
                'Л': 'L', 'л': 'l',
                'М': 'M', 'м': 'm',
                'Н': 'N', 'н': 'n',
                'О': 'O', 'о': 'o',
                'П': 'P', 'п': 'p',
                'Р': 'R', 'р': 'r',
                'С': 'S', 'с': 's',
                'Т': 'T', 'т': 't',
                'У': 'U', 'у': 'u',
                'Ӯ': 'Ū', 'ӯ': 'ū',
                'Ф': 'F', 'ф': 'f',
                'Х': 'H', 'х': 'h',
                'Ҳ': 'Ḩ', 'ҳ': 'ḩ',
                'Ч': 'Č', 'ч': 'č',
                'Ҷ': 'Ç', 'ҷ': 'ç',
                'Ш': 'Š', 'ш': 'š',
                'Ъ': 'ʺ', 'ъ': 'ʺ',
                'Э': 'È', 'э': 'è',
                'Ю': 'Û', 'ю': 'û',
                'Я': 'Â', 'я': 'â'
            }
        }
    }
}