import type { Lang } from "#shared/types/rule";

export const hy: Lang = {
  langName: 'Armenian',
  rules: {
    iso_9985_1996: {
      name: 'ISO 9985',
      desc: 'International standard for converting Armenian letters into Latin letters',
      map: {
        'Ա': 'A', 'ա': 'a',
        'Բ': 'B', 'բ': 'b',
        'Գ': 'G', 'գ': 'g',
        'Դ': 'D', 'դ': 'd',
        'Ե': 'E', 'ե': 'e',
        'Զ': 'Z', 'զ': 'z',
        'Է': 'Ē', 'է': 'ē',
        'Ը': 'Ë', 'ը': 'ë',
        'Թ': 'Tʼ', 'թ': 'tʼ',
        'Ժ': 'Ž', 'ժ': 'ž',
        'Ի': 'I', 'ի': 'i',
        'Լ': 'L', 'լ': 'l',
        'Խ': 'X', 'խ': 'x',
        'Ծ': 'Ç', 'ծ': 'ç',
        'Կ': 'K', 'կ': 'k',
        'Հ': 'H', 'հ': 'h',
        'Ձ': 'J', 'ձ': 'j',
        'Ղ': 'Ġ', 'ղ': 'ġ',
        'Ճ': 'Č̣', 'ճ': 'č̣',
        'Մ': 'M', 'մ': 'm',
        'Յ': 'Y', 'յ': 'y',
        'Ն': 'N', 'ն': 'n',
        'Շ': 'Š', 'շ': 'š',
        'Ո': 'O', 'ո': 'o',
        'Չ': 'Č', 'չ': 'č',
        'Պ': 'P', 'պ': 'p',
        'Ջ': 'ǰ', 'ջ': 'ǰ',
        'Ռ': 'Ṙ', 'ռ': 'ṙ',
        'Ս': 'S', 'ս': 's',
        'Վ': 'V', 'վ': 'v',
        'Տ': 'T', 'տ': 't',
        'Ր': 'R', 'ր': 'r',
        'Ց': 'Cʼ', 'ց': 'cʼ',
        'Ւ': 'W', 'ւ': 'w',
        'Փ': 'Pʼ', 'փ': 'pʼ',
        'Ք': 'Kʼ', 'ք': 'kʼ',
        'Օ': 'Ò', 'օ': 'ò',
        'Ֆ': 'F', 'ֆ': 'f',
      }
    }
  }
}